legacy/src/main/resources/soap/delete_soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:patient="http://legacy.com/patients">
    <soapenv:Header/>
    <soapenv:Body>
        <patient:deletePatientRequest>
            <patient:id>0</patient:id>
        </patient:deletePatientRequest>
    </soapenv:Body>
</soapenv:Envelope>